In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
df=pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
A  0.149456 -0.580939  0.979467
B  0.621925  1.722168 -1.564349
C  0.433103 -0.175081 -0.323911
D -1.809075  1.412858 -0.222001

In [4]:
df>-0.5

   Column1  Column2  Column3
A     True    False     True
B     True     True    False
C     True     True     True
D    False     True     True

In [5]:
df[df>-0.5]

    Column1   Column2   Column3
A  0.149456       NaN  0.979467
B  0.621925  1.722168       NaN
C  0.433103 -0.175081 -0.323911
D       NaN  1.412858 -0.222001

In [6]:
df["Column1"]>0

A     True
B     True
C     True
D    False
Name: Column1, dtype: bool

In [7]:
df[df["Column1"]>0]

    Column1   Column2   Column3
A  0.149456 -0.580939  0.979467
B  0.621925  1.722168 -1.564349
C  0.433103 -0.175081 -0.323911

In [8]:
df[(df["Column1"]>0) & (df["Column2"]>0)]

    Column1   Column2   Column3
B  0.621925  1.722168 -1.564349

In [9]:
df[(df["Column1"]>0) | (df["Column2"]>0)]

    Column1   Column2   Column3
A  0.149456 -0.580939  0.979467
B  0.621925  1.722168 -1.564349
C  0.433103 -0.175081 -0.323911
D -1.809075  1.412858 -0.222001

In [10]:
df["Column4"]=randn(4)

In [11]:
df

    Column1   Column2   Column3   Column4
A  0.149456 -0.580939  0.979467  1.786320
B  0.621925  1.722168 -1.564349 -0.762809
C  0.433103 -0.175081 -0.323911  1.029206
D -1.809075  1.412858 -0.222001 -0.693300

In [12]:
df["Column5"]=["newvalue1","newvalue2","newvalue3","newvalue4"]

In [13]:
df

    Column1   Column2   Column3   Column4    Column5
A  0.149456 -0.580939  0.979467  1.786320  newvalue1
B  0.621925  1.722168 -1.564349 -0.762809  newvalue2
C  0.433103 -0.175081 -0.323911  1.029206  newvalue3
D -1.809075  1.412858 -0.222001 -0.693300  newvalue4

In [14]:
df.set_index("Column5",inplace=True)

In [15]:
df

            Column1   Column2   Column3   Column4
Column5
newvalue1  0.149456 -0.580939  0.979467  1.786320
newvalue2  0.621925  1.722168 -1.564349 -0.762809
newvalue3  0.433103 -0.175081 -0.323911  1.029206
newvalue4 -1.809075  1.412858 -0.222001 -0.693300

In [17]:
df.index.names

FrozenList(['Column5'])